import hashlib

text = "ΤΜΗΜΑ ΠΛΗΡΟΦΟΡΙΚΗΣ ΚΑΙ ΤΗΛΕΠΙΚΟΙΝΩΝΙΩΝ"
d = 7 # Ο αριθμός των μηδενικών που πρέπει να έχει η hash τιμή στο τέλος

# Επαναληπτική διαδικασία για τον έλεγχο ακεραίων μέχρι να βρεθεί ο επιθυμητός αριθμός
x = 0
while True:
    x += 1
    new_text = text + str(x)
    new_hash = hashlib.sha256(new_text.encode()).hexdigest()
    if new_hash[-d:] == "0" * d:
        break

print("Ο επιθυμητός ακέραιος αριθμός είναι:", x)
print("Το νέο κείμενο είναι:", new_text)
print("Η hash τιμή του νέου κειμένου είναι:", new_hash)


# Ο επιθυμητός ακέραιος αριθμός είναι: 113357317
# Το νέο κείμενο είναι: ΤΜΗΜΑ ΠΛΗΡΟΦΟΡΙΚΗΣ ΚΑΙ ΤΗΛΕΠΙΚΟΙΝΩΝΙΩΝ113357317
# Η hash τιμή του νέου κειμένου είναι: 392ea340cf29585a1043a190967e19815d39b7ff58486d8ba1ff9d0e00000000