# Ανάθεση (=)
a = [1, 2, 3]  # 'a' δείχνει σε ένα αντικείμενο λίστας

# Ισότητα (==)
b = [1, 2, 3]
print(a == b)  # True -> και οι δύο λίστες έχουν το ίδιο περιεχόμενο

# ταυτότητα (is)
print(a is b)  # False -> Διαφορετικά αντικείμενα στη μνήμη

# Ταυτότητα σε immutable τύπους
x = 5
y = 5
print(x == y)  # True -> ϊδια τιμή
print(
    x is y
)  # True -> Οι μικροί ακέραιοι γίνονται cache, συνεπώς x, y αναφέρονται στο ίδιο αντικείμενο

# Ταυτότητα με mutable τύπους
c = a  #  η μεταβλητή c αναφέρεται στην ίδια λίστα με την μεταβλητή a
print(a is c)  # True -> η c και η a είναι το ίδιο αντικείμενο στη μνήμη

# Οι αλλαγές στο a επηρεάζουν και το c
a.append(4)
print(c)  # [1, 2, 3, 4]

# Χρήση του is σε strings
s1 = "hello"
s2 = "hello"
print(s1 == s2)  # True -> Ίδια περιεχόμενα
print(
    s1 is s2
)  # True -> Τα μικρά strings γίνονται cache, συνεπώς s1, s2 αναφέρονται στο ίδιο αντικείμενο

# Αλλά με μεγαλύτερα αντικείμενα (πο μπορεί να μη γίνουν interned)
s3 = "hello world, this is a long string" * 1000
s4 = "hello world, this is a long string" * 1000
print(s3 == s4)  # True -> ίδιο περιεχόμενο
print(s3 is s4)  # Μπορεί να είναι False -> Διαφορετικά αντικείμενα στη μνήμη
