print(3 / 2)  # εκτυπώνει 1.5
print(3 // 2)  # εκτυπώνει 1
print(-7 // 2)  # εκτυπώνει -4 (στρογυλλοποίηση προς μικρότερο ακέραιο αριθμό)


print(2 + -3 * 4)  # εκτυπώνει -10 (υψηλότερη προτεραιότητα του μοναδιαίου - από το *)

# fmt:off
print(2 * 3 * 4) # εκτυπώνει 24 (από αριστερά προς τα δεξιά αποτίμηση για τον τελεστή *, όπως και για +, -, /)
print(2**3**2) # εκτυπώνει 512 (από δεξιά προς τα αριστερά αποτίμηση για τον τελεστή **)
print(-2**4)  # εκτυπώνει -16 (υψηλότερη προτεραιότητα του ** από το μοναδιαίο -)
# fmt: on

print(2 < 3 and 3 < 4)  # εκτυπώνει True
print(2 < 3 < 4)  # εκτυπώνει True (ισοδύναμο με το παραπάνω)

# fmt:off
print(3 & 5) # εκτυπώνει 1, διότι οι αριθμοί μετατρέπονται σε δυαδικούς και γίνεται η πράξη bitwise AND
# fmt: on
