import unittest
import random


def e_approx(n):
    """
    Προσέγγιση της σταθεράς e=2.7182... προσομοιώνοντας τη διαδικασία υπολογισμού
    του αθροίσματος τυχαίων αριθμών στο διάστημα (0,1) μέχρι το άθροισμά τους
    να ξεπεράσει το 1.

    Ορίσματα:
        n (int): Το πλήθος των προσομοιώσεων που θα γίνουν.

    Επιτρέφει:
        float: Το μέσο πλήθος των επαναλήψεων που απαιτούνται για να γίνει το
        συσωρευτικό άθροισμα μεγαλύτερο από 1 σε όλες τις προσομοιώσεις.

    """
    total = 0
    for _ in range(n):
        s = 0
        c = 0
        while s < 1:
            s += random.random()
            c += 1
        total += c
    return total / n


# Mην αλλάξετε κάτι από εδώ και κάτω
class Test(unittest.TestCase):
    """
    Περίπτωση ελέγχου επαλήθευσης της ακρίβειας υπολογισμού της συνάρτησης e_approx.

    Επαληθεύει ότι η επιστρεφόμενη τιμή από τη συνάρτηση e_approx function είναι
    κατά προσέγγιση ίση με τη σταθερά e με μια ανοχή delta.
    """

    def test_e_approximation(self):
        self.assertAlmostEqual(e_approx(1_000_000), 2.718, delta=0.001)


if __name__ == "__main__":
    unittest.main()
